# %%
# هذا هو الكود الخاص بمعالجة البيانات وتحويلها الى vectordb 
from langchain_community.embeddings.ollama import OllamaEmbeddings

# %%
embedding=OllamaEmbeddings(model="nomic-embed-text")
# # %%
from langchain_chroma import Chroma
persist_directory = "/home/abdulmalek-alsalmi/Desktop/SA/the_project/chroma"

# %%
words=[
    "رجل الإطفاء", "رأس", "يستحم", "يأكل", "يتمرن", "يمشي", "يدرس", "يصحو",
    "قفاز", "جورب", "بنطال", "شال", "جزمة", "سفينة", "دراجة نارية", "مروحية",
    "غواصة", "طائرة", "سفينة تجارية", "سفينة فضاء", "جرار", "ثلاجة", "سيارة",
    "غرفة الطعام", "رف", "كرسي", "مرحاض", "مغسلة", "مصباح كهربائي", "بازلاء",
    "بصل", "خيار", "جزر", "فلفل أخضر", "ملفوف", "فجل", "بصر", "طباخ", "الحواس الخمس",
    "دهان", "رسام", "نحات", "قائد أوركسترا", "راعي", "حلاق", "بحار", "طيار", "رائد فضاء", "ممرضة",
    "غسالة", "فرن", "مطبخ", "جارور", "منشفة", "غرفة النوم", "غرفة الحمام", "بندورة", "بطاطا", "الخضروات",
    "باذنجان", "اللمس", "الذوق", "السمع", "الشم", "مغنية", "ممثلة", "خياط", "خباز", "عازف", "صياد",
    "سائق", "باني", "نجار", "السبت", "كهربائي", "الخميس", "الاربعاء", "الجمعة", "الثلاثاء", "الأحد",
    "الإثنين", "أيام الأسبوع", "فراولة", "خروف", "فزاعة", "حصان", "طاحونة", "دجاجة", "بطة", "قش", 
    "قط", "ديك رومي", "محصول", "حضيرة", "أرنب", "ديك", "جرار", "مزارع", "ماعز", "كلب", "بقرة", 
    "صوص", "ثور", "لون أحمر", "لون أبيض", "لون أسود", "لون بنفسجي", "لون زهري", "لون برتقالي",
    "لون أخضر", "لون رمادي", "لون أصفر", "لون بني", "لون أزرق", "رمان", "بطيخ", "أناناس", "أجاص", 
    "مانجو", "عنب", "كرز", "موز", "تفاح", "الفاكهة"
]
vectordb = Chroma.from_texts(
        texts=words,
        embedding=embedding,
        persist_directory=persist_directory
    )
